{
    "header": {
    "name": "Iván Naranjo Broceño",
    "role": "Desarrollador Web",
    "location": "Ciudad Real, España",
    "email": "ivnabro@gmail.com"
    },

    "nav": {
    "about": "Sobre mí",
    "experience": "Experiencia",
    "skills": "Skills",
    "projects": "Proyectos",
    "contact": "Contacto"
    },

    "about": {
    "title": "Sobre mí",
    "description": "Desarrollador web altamente motivado con un fuerte compromiso con el aprendizaje continuo y sólidas habilidades en el diseño de interfaces, desarrollo y mantenimiento de sitios web. Demuestra la capacidad de trabajar de manera efectiva tanto de forma independiente como en entornos colaborativos, entregando soluciones de alta calidad que cumplen y superan las expectativas del cliente. Apasionado por mantenerse al día con las últimas tecnologías y mejorar continuamente sus habilidades técnicas."
    },

    "key": {
        "skill" : "Skills Claves"
    }, 

    "experience": {
    "title": "Experiencia",
    "job1_title": "Técnico de Sistemas Microinformáticos y Redes",
    "job1_period": "2022 - 2024",
    "job1_desc": "He creado y gestionado plataformas educativas en Moodle, diseñando y personalizando cursos según las necesidades de los usuarios. Además, he desarrollado páginas web utilizando HTML5, CSS y JavaScript, integrando contenido interactivo y funcional. También he diseñado hojas de cálculo en Excel aplicando lógica de programación para automatizar procesos, y he implementado soluciones de automatización en Access, optimizando la gestión y el flujo de información."
                                ,
    "job2_title": "Técnico Superior de Desarrollo Web",
    "job2_period": "2024 - 2026 (En proceso)",
    "job2_desc": "He desarollado programas en Java, realizando diversos proyectos que incluyen el uso de base ed datos como MySQL y la gestión de contenedores Docker. Además de estas tecnologías, he adquirido experiencia en diseño de interfaces con Figma, he profundizado en JavaScript y aprendido un nuevo lenguaje PHP, trabajando con framworks y liberías como Bootstrap, AngularJS y Laravel."
    },

    "projects": {
    "title": "Proyectos",
    "project1_title": "Proyecto Personal - Portafolio",
    "project1_desc": "Creé un sitio web personal para mostrar mi experiencia profesional en detalle."
    },

    "contact": {
    "title": "Contacto",
    "email": "Email",
    "message": "Mensaje"
    },

    "footer": {
    "copyright": "© 2025 Iván Naranjo Broceño. Todos los derechos reservados."
    }
}
