{
    "header": {
    "name": "Iván Naranjo Broceño",
    "role": "Développeur Web",
    "location": "Ciudad Real, Espagne",
    "email": "ivnabro@gmail.com"
    },

    "nav": {
    "about": "À propos de moi",
    "experience": "Expérience",
    "skills": "Compétences",
    "projects": "Projets",
    "contact": "Contact"
    },

    "about": {
    "title": "À propos de moi",
    "description": "Développeur web hautement motivé, avec un fort engagement envers l'apprentissage continu et de solides compétences en conception d'interfaces, développement et maintenance de sites web. Capable de travailler efficacement aussi bien de manière autonome qu'en équipe, en livrant des solutions de haute qualité qui répondent et dépassent les attentes des clients. Passionné par les nouvelles technologies et l'amélioration constante de ses compétences techniques."
    },   
    
    "key": {
        "skill" : "Compétences clés"
    },
    
    "experience": {
    "title": "Expérience",
    "job1_title": "Technicien en systèmes micro-informatiques et réseaux",
    "job1_period": "2022 - 2024",
    "job1_desc": "J'ai créé et géré des plateformes éducatives sur Moodle, en concevant et en personnalisant des cours selon les besoins des utilisateurs. J'ai également développé des pages web en utilisant HTML5, CSS et JavaScript, en intégrant du contenu interactif et fonctionnel. J'ai conçu des feuilles de calcul dans Excel en appliquant une logique de programmation pour automatiser des processus, et j'ai mis en œuvre des solutions d'automatisation dans Access, optimisant ainsi la gestion et le flux d'informations."
    ,
    "job2_title": "Technicien supérieur en développement web",
    "job2_period": "2024 - 2026 (En cours)",
    "job2_desc": "J'ai développé des programmes en Java, en réalisant divers projets incluant l'utilisation de bases de données comme MySQL et la gestion de conteneurs avec Docker. En plus de ces technologies, j'ai acquis de l'expérience en conception d'interfaces avec Figma, approfondi mes connaissances en JavaScript et appris un nouveau langage, PHP, en travaillant avec des frameworks et bibliothèques tels que Bootstrap, AngularJS et Laravel."
    },

    "projects": {
    "title": "Projets",
    "project1_title": "Projet personnel - Portfolio",
    "project1_desc": "J'ai créé un site web personnel pour présenter en détail mon expérience professionnelle."
    },

    "detailed_experience": {
        "title": "Rôles et Développement",
        "intro": "Dans cette section, je parlerai en détail des rôles et des projets que j'ai réalisés tout au long de mon parcours professionnel.",

            "title1": "Technicien en systèmes micro-informatiques et réseaux",
            "institution1": "Arcadie College",
            "desc1": "J'ai créé et géré diverses plateformes éducatives avec Moodle, en les adaptant aux besoins spécifiques des utilisateurs. Cela comprenait la conception, la structuration et la personnalisation de cours virtuels, ainsi que la configuration d'activités, de ressources et d'évaluations pour favoriser une expérience d'apprentissage dynamique et efficace. En parallèle, j'ai développé des sites web avec HTML5, CSS et JavaScript, intégrant du contenu interactif et fonctionnel. J'ai également automatisé des processus administratifs avec Microsoft Excel et conçu des bases de données relationnelles et des formulaires personnalisés avec Microsoft Access.",

            "title2": "Technicien supérieur en développement web",
            "institution2": "Indra",
            "desc2": "J'ai développé des applications en Java, participant à des projets nécessitant une logique de programmation et une intégration avec des bases de données comme MySQL. J'ai utilisé Docker pour gérer les conteneurs, facilitant le déploiement et améliorant l'évolutivité. J'ai conçu des interfaces utilisateur avec Figma et collaboré à la création de prototypes visuels. J'ai approfondi mes connaissances en JavaScript et PHP, en utilisant des frameworks comme Laravel, Bootstrap et AngularJS pour développer des applications web robustes et réactives."

    },

    "contact": {
    "title": "Contact",
    "email": "Email",
    "message": "Message"
    },

    "footer": {
    "copyright": "© 2025 Iván Naranjo Broceño. Tous droits réservés."
    }
}